app/controllers/distances_controller.rb

  def index
    @distances = Distance.all
---
SELECT * FROM "distances"

  def show
    @distance = Distance.find(params[:id])
---
SELECT * FROM "distances" WHERE ("distances"."id" = 1)

  def create
    @distance = Distance.new(params[:distance])

    respond_to do |format|
      if @distance.save
---
INSERT INTO "distances" ("kilometers", "from_id", "to_id") VALUES(0.0, 1, 1)